Merge pull request #15 from HenriqueArtur/refact-engines
Refact engines
